# 3. Задача на целые степени двойки, не превосходящие числа N

n = input("Enter N: ")
n = int(n)
m = 1
while m < n:
     print (m,end=' ')
     m = m * 2